In [33]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [7]:
df = pd.read_html("https://static.bc-edx.com/data/web/mars_facts/temperature.html")
mars_data_df = df[0]
mars_data_df

        id terrestrial_date   sol   ls  month  min_temp  pressure
0        2       2012-08-16    10  155      6     -75.0     739.0
1       13       2012-08-17    11  156      6     -76.0     740.0
2       24       2012-08-18    12  156      6     -76.0     741.0
3       35       2012-08-19    13  157      6     -74.0     732.0
4       46       2012-08-20    14  157      6     -74.0     740.0
...    ...              ...   ...  ...    ...       ...       ...
1862  1889       2018-02-23  1973  133      5     -78.0     730.0
1863  1892       2018-02-24  1974  134      5     -77.0     729.0
1864  1894       2018-02-25  1975  134      5     -76.0     729.0
1865  1893       2018-02-26  1976  135      5     -77.0     728.0
1866  1895       2018-02-27  1977  135      5     -77.0     727.0

[1867 rows x 7 columns]

In [8]:
mars_data_df.dtypes

id                    int64
terrestrial_date     object
sol                   int64
ls                    int64
month                 int64
min_temp            float64
pressure            float64
dtype: object

In [9]:
mars_data_df.astype({'terrestrial_date': 'datetime64[ns]',
                     'sol' : 'int64',
                     'ls' : 'int64',
                     'month' : 'int64',
                     'min_temp': 'float64',
                     'pressure': 'float64'}).dtypes

id                           int64
terrestrial_date    datetime64[ns]
sol                          int64
ls                           int64
month                        int64
min_temp                   float64
pressure                   float64
dtype: object

In [35]:
mars_data_df

        id terrestrial_date   sol   ls  month  min_temp  pressure
0        2       2012-08-16    10  155      6     -75.0     739.0
1       13       2012-08-17    11  156      6     -76.0     740.0
2       24       2012-08-18    12  156      6     -76.0     741.0
3       35       2012-08-19    13  157      6     -74.0     732.0
4       46       2012-08-20    14  157      6     -74.0     740.0
...    ...              ...   ...  ...    ...       ...       ...
1862  1889       2018-02-23  1973  133      5     -78.0     730.0
1863  1892       2018-02-24  1974  134      5     -77.0     729.0
1864  1894       2018-02-25  1975  134      5     -76.0     729.0
1865  1893       2018-02-26  1976  135      5     -77.0     728.0
1866  1895       2018-02-27  1977  135      5     -77.0     727.0

[1867 rows x 7 columns]

In [20]:
months = mars_data_df['month'].nunique()
months

12

In [23]:
days_of_data = mars_data_df['sol'].count()
days_of_data

1867

In [42]:
average_low = mars_data_df.groupby(['month'])['min_temp'].mean()
average_low

month
1    -77.160920
2    -79.932584
3    -83.307292
4    -82.747423
5    -79.308725
6    -75.299320
7    -72.281690
8    -68.382979
9    -69.171642
10   -71.982143
11   -71.985507
12   -74.451807
Name: min_temp, dtype: float64

In [69]:
average_low = mars_data_df.groupby(['month'])['min_temp'].mean().reset_index()
average_low

# plt.bar(average_low['month'], average_low['min_temp'], color = 'purple')
# plt.xticks(average_low['month'])
# plt.xlabel('Month')
# plt.ylabel('Temperature (Celsius)')
# plt.title("Average Temperature by Month on Mars")
# plt.show

    month   min_temp
0       1 -77.160920
1       2 -79.932584
2       3 -83.307292
3       4 -82.747423
4       5 -79.308725
5       6 -75.299320
6       7 -72.281690
7       8 -68.382979
8       9 -69.171642
9      10 -71.982143
10     11 -71.985507
11     12 -74.451807

In [86]:
average_low = mars_data_df.groupby(['month'])['min_temp'].mean().reset_index().sort_values(mars_data_df['min_temp'])
average_low
#temp_range = average_low.groupby(['month'])['min_temp'].reset_index()
# temp_range = average_low['min_temp'].sort_values()
# temp_range
# temp_range_df = temp_range.reset_index()
# temp_range_df

# plt.bar(temp_range['month'], temp_range['min_temp'], color = 'purple')
# plt.xticks(temp_range['month'])
# plt.xlabel('Month')
# plt.ylabel('Temperature (Celsius)')
# plt.title("Coldest to Hottest Temperature by Month on Mars")
# plt.show

KeyError: 0      -75.0
1      -76.0
2      -76.0
3      -74.0
4      -74.0
        ...
1862   -78.0
1863   -77.0
1864   -76.0
1865   -77.0
1866   -77.0
Name: min_temp, Length: 1867, dtype: float64